Show / Hide Table of Contents
Class AutomationHostingGrpc<MyInterface, ClientInterface>
Grpc Hosting implementation of AutomationHosting<MyInterface, ClientInterface>
Inheritance
System.Object
AutomationHostingGrpc<MyInterface, ClientInterface>
Implements
IBIMPluginClient<ClientInterface>
System.IDisposable
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaStatiCa.Plugin
Assembly: IdeaStatiCa.Plugin.dll
Syntax
public class AutomationHostingGrpc<MyInterface, ClientInterface> : IBIMPluginClient<ClientInterface>, IDisposable where MyInterface : class where ClientInterface : class
Type Parameters
 Name |  Description
 MyInterface
 ClientInterface
Constructors
Improve this Doc   View Source
AutomationHostingGrpc(MyInterface, Int32, IPluginLogger, String)
Declaration
public AutomationHostingGrpc(MyInterface hostedService, int grpcPort, IPluginLogger logger = null, string eventName = "IdeaStatiCaBIMPluginEvent")
Parameters
 Type |  Name |  Description
 MyInterface |  hostedService
 System.Int32 |  grpcPort
 IPluginLogger |  logger
 System.String |  eventName
Properties
Improve this Doc   View Source
GrpcPort
Port on which the Grpc server is running.
Declaration
public int GrpcPort { get; }
Property Value
 Type |  Description
 System.Int32
Improve this Doc   View Source
IsConnected
Determines whether automation hosting is connected to Grpc server.
Declaration
public bool IsConnected { get; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
MyBIM
My BIM object.
Declaration
public ClientInterface MyBIM { get; }
Property Value
 Type |  Description
 ClientInterface
Improve this Doc   View Source
Status
Current automation status.
Declaration
public AutomationStatus Status { get; }
Property Value
 Type |  Description
 AutomationStatus
Methods
Improve this Doc   View Source
Dispose()
Declaration
public void Dispose()
Improve this Doc   View Source
Dispose(Boolean)
Declaration
protected virtual void Dispose(bool disposing)
Parameters
 Type |  Name |  Description
 System.Boolean |  disposing
Improve this Doc   View Source
NotifyBIMStatusChanged(AppStatus)
Declaration
protected virtual void NotifyBIMStatusChanged(AppStatus newStatus)
Parameters
 Type |  Name |  Description
 AppStatus |  newStatus
Improve this Doc   View Source
RunAsync(String)
Declaration
public Task RunAsync(string id)
Parameters
 Type |  Name |  Description
 System.String |  id
Returns
 Type |  Description
 System.Threading.Tasks.Task
Improve this Doc   View Source
RunServer(String, CancellationToken)
Declaration
protected virtual void RunServer(string id, CancellationToken cancellationToken)
Parameters
 Type |  Name |  Description
 System.String |  id
 System.Threading.CancellationToken |  cancellationToken
Improve this Doc   View Source
Stop()
Declaration
public void Stop()
Events
Improve this Doc   View Source
BIMStatusChanged
Triggered when BIM status changes.
Declaration
public event ISEventHandler BIMStatusChanged
Event Type
 Type |  Description
 ISEventHandler
Implements
 IBIMPluginClient<T>
 System.IDisposable
 Improve this Doc
 View Source